# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import httpx
from selectolax.parser import HTMLParser
import re

# Get Data From vlr.gg

In [9]:
base_url = 'https://www.vlr.gg'

event_url = '/event/matches/1188/champions-tour-2023-lock-in-s-o-paulo/?series_id=all'
event_url = '/event/matches/1530/project-v-pro-weekly-6/?series_id=all'

res = httpx.get(base_url+event_url)

html = HTMLParser(res.text)

matches = html.css('a.wf-module-item')

completed_matches = [match for match in matches if match.css_first('div.ml-status').text() == 'Completed']


perfect_completed_matches = completed_matches[:21] + completed_matches[22:30] + completed_matches[31:]

for index,match in enumerate(completed_matches):
    match_res = httpx.get(match_url := f'{base_url}{match.attributes["href"]}')

    match_html = HTMLParser(match_res.text)

    match_name = match_html.css_first('title').text().strip().split(' | ')[0].split(' vs. ')

    messy_match_result = match_html.css_first('div.js-spoiler').text()
    match_result = ' ' + ''.join(re.findall("\S+",messy_match_result)) + ' '

    print(index, '>> ',end='')
    print(match_sum:=match_result.join(match_name))

    tables = match_html.css('table.wf-table-inset')

    for table in tables:
        for t in pd.read_html(table.html):
            display(transform_subcolumns_df(t).head(2))
            # transform_subcolumns_df(t)
    #         sample_df = t
    #         for key,df in get_clean_df(t).items():
    #             pass

0 >> Cologne Bubbele 0:1 Capybara Huggers

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      Lele  Colo  1.26  1.51  0.87  351  443  216  23  17  ...  39   6   3
1     Vince  Colo  0.99  0.80  1.27  161  130  209  12   5  ...  22   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   3   2   1    +3  +1  +2
1      0   1   1   0    -1  -1   0

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     stepa  Capy  1.81  2.21  1.55  318  435  241  25  15  ...  33   3   1
1       Nex  Capy  1.40  1.20  1.54  262  217  292  20   6  ...  16   7   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   0   0   0    +3  +1  +2
1      5   2   2   0    +5   0  +5

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      Lele  Colo  1.26  1.51  0.87  351  443  216  23  17  ...  39   6   3
1     Vince  Colo  0.99  0.80  1.27  161  130  209  12   5  ...  22   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   3   2   1    +3  +1  +2
1      0   1   1   0    -1  -1   0

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     stepa  Capy  1.81  2.21  1.55  318  435  241  25  15  ...  33   3   1
1       Nex  Capy  1.40  1.20  1.54  262  217  292  20   6  ...  16   7   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   0   0   0    +3  +1  +2
1      5   2   2   0    +5   0  +5

[2 rows x 38 columns]

1 >> WAS JETZT? 1:0 INF Esports

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     shiddy  WAS  1.88  1.21  2.10  236   74  291  13   1  ...  12   4   0
1      reyvn  WAS  1.46  1.05  1.60  173  137  185  13   3  ...  32   2   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   0   0   0    +4   0  +4
1      2   0   0   0    +2   0  +2

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Hilsbeck  INF  0.75  0.73  0.80  188  179  217  10   7  ...  17   1   1
1      akameit  INF  0.59  0.48  0.89  162  135  246   8   4  ...  44   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   1   0     0   0   0
1      0   1   1   0    -1  -1   0

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     shiddy  WAS  1.88  1.21  2.10  236   74  291  13   1  ...  12   4   0
1      reyvn  WAS  1.46  1.05  1.60  173  137  185  13   3  ...  32   2   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   0   0   0    +4   0  +4
1      2   0   0   0    +2   0  +2

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Hilsbeck  INF  0.75  0.73  0.80  188  179  217  10   7  ...  17   1   1
1      akameit  INF  0.59  0.48  0.89  162  135  246   8   4  ...  44   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   1   0     0   0   0
1      0   1   1   0    -1  -1   0

[2 rows x 38 columns]

2 >> RedPack eSports 1:0 HEIZUNG AUF 5

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Jxlius   RP  1.46  0.94  1.90  317  305  329  25  10  ...  34   0   0
1      NyaRu   RP  1.27  0.79  1.66  260  188  322  20   6  ...  22   6   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   0   0   0     0   0   0
1      3   5   3   2    +1   0  +1

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      Kirby  HEIZ  1.13  0.61  1.75  283  206  377  22   8  ...  45   3   1
1     KlausC  HEIZ  0.89  0.73  1.09  183  180  187  14   7  ...   4   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   3   1   2     0   0   0
1      1   2   0   2     0  +1  -1

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Jxlius   RP  1.46  0.94  1.90  317  305  329  25  10  ...  34   0   0
1      NyaRu   RP  1.27  0.79  1.66  260  188  322  20   6  ...  22   6   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   0   0   0     0   0   0
1      3   5   3   2    +1   0  +1

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      Kirby  HEIZ  1.13  0.61  1.75  283  206  377  22   8  ...  45   3   1
1     KlausC  HEIZ  0.89  0.73  1.09  183  180  187  14   7  ...   4   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   3   1   2     0   0   0
1      1   2   0   2     0  +1  -1

[2 rows x 38 columns]

3 >> Kaizen 0:1 Bloodh0nd Gang

Type     Name  Team     R              ACS             K      ... HS%  FK      \
Side     Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0       z7eus  Kaiz  1.02  1.55  0.67  246  359  171  18  11  ...  60   5   3
1     TeTrixX  Kaiz  0.89  1.04  0.79  261  284  246  16   8  ...  14   2   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   4   2   2    +1  +1   0
1      2   0   0   0    +2   0  +2

[2 rows x 38 columns]

Type       Name  Team     R              ACS             K      ... HS%  FK  \
Side       Name  Team   all   atk   def  all  atk  def all atk  ... def all
0         Ayzee  Bloo  1.68  1.99  1.20  352  408  270  25  18  ...  35   3
1     KANKURATA  Bloo  1.34  1.37  1.29  318  297  351  21  11  ...  21   4

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      3   0   3   2   1     0  +1  -1
1      2   2   0   0   0    +4  +2  +2

[2 rows x 38 columns]

Type     Name  Team     R              ACS             K      ... HS%  FK      \
Side     Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0       z7eus  Kaiz  1.02  1.55  0.67  246  359  171  18  11  ...  60   5   3
1     TeTrixX  Kaiz  0.89  1.04  0.79  261  284  246  16   8  ...  14   2   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   4   2   2    +1  +1   0
1      2   0   0   0    +2   0  +2

[2 rows x 38 columns]

Type       Name  Team     R              ACS             K      ... HS%  FK  \
Side       Name  Team   all   atk   def  all  atk  def all atk  ... def all
0         Ayzee  Bloo  1.68  1.99  1.20  352  408  270  25  18  ...  35   3
1     KANKURATA  Bloo  1.34  1.37  1.29  318  297  351  21  11  ...  21   4

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      3   0   3   2   1     0  +1  -1
1      2   2   0   0   0    +4  +2  +2

[2 rows x 38 columns]

4 >> Doomster 1:0 Big Blue Charizard

Type      Name  Team     R              ACS             K      ... HS%  FK  \
Side      Name  Team   all   atk   def  all  atk  def all atk  ... def all
0     Daveeski  Doom  1.51  1.83  1.33  341  467  269  23  12  ...  18   7
1        shiio  Doom  1.40  1.31  1.45  282  251  300  21   7  ...  27   1

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      4   3   4   0   4    +3  +4  -1
1      0   1   0   0   0    +1   0  +1

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0       Atom  BBC  1.26  1.31  1.16  266  303  205  18  13  ...  36   1   1
1     FraqqS  BBC  0.96  0.87  1.10  184  192  172  11   7  ...  14   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   0   0   0    +1  +1   0
1      0   1   0   1     0  +1  -1

[2 rows x 38 columns]

Type      Name  Team     R              ACS             K      ... HS%  FK  \
Side      Name  Team   all   atk   def  all  atk  def all atk  ... def all
0     Daveeski  Doom  1.51  1.83  1.33  341  467  269  23  12  ...  18   7
1        shiio  Doom  1.40  1.31  1.45  282  251  300  21   7  ...  27   1

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      4   3   4   0   4    +3  +4  -1
1      0   1   0   0   0    +1   0  +1

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0       Atom  BBC  1.26  1.31  1.16  266  303  205  18  13  ...  36   1   1
1     FraqqS  BBC  0.96  0.87  1.10  184  192  172  11   7  ...  14   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   0   0   0    +1  +1   0
1      0   1   0   1     0  +1  -1

[2 rows x 38 columns]

5 >> TeamOrangeGaming 0:1 Reveal Multigaming

Type     Name Team     R              ACS             K      ... HS%  FK      \
Side     Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Narutey  TOG  1.13  0.93  1.24  259  219  283  18   5  ...  41   0   0
1       Marik  TOG  0.98  0.74  1.12  196  151  223  13   4  ...  37   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   0   1    -1   0  -1
1      1   2   1   1     0   0   0

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      RxYaL   RV  1.55  1.70  1.30  287  302  262  21  14  ...  28   1   1
1     CALVIN    S  1.38  1.03  1.99  283  248  346  21  11  ...  45   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   2   1   1    -1   0  -1
1      1   1   1   0    +1   0  +1

[2 rows x 38 columns]

Type     Name Team     R              ACS             K      ... HS%  FK      \
Side     Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Narutey  TOG  1.13  0.93  1.24  259  219  283  18   5  ...  41   0   0
1       Marik  TOG  0.98  0.74  1.12  196  151  223  13   4  ...  37   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   0   1    -1   0  -1
1      1   2   1   1     0   0   0

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      RxYaL   RV  1.55  1.70  1.30  287  302  262  21  14  ...  28   1   1
1     CALVIN    S  1.38  1.03  1.99  283  248  346  21  11  ...  45   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   2   1   1    -1   0  -1
1      1   1   1   0    +1   0  +1

[2 rows x 38 columns]

6 >> eSports Cologne 1:0 Yes I'm here

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      zery  ECO  1.39  1.13  1.78  250  245  260  20  11  ...  22   4   2
1     Amore  ECO  1.33  1.15  1.60  237  251  217  20  12  ...  22   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   4   2   2     0   0   0
1      0   1   1   0     0   0   0

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0          shy  Yes  1.07  1.16  1.02  212  273  172  15   7  ...  20   6   2
1     McKonsti  Yes  0.84  0.87  0.82  203  272  158  13   7  ...  23   1   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   3   2   1    +3   0  +3
1      1   1   0   1     0   0   0

[2 rows x 38 columns]

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      zery  ECO  1.39  1.13  1.78  250  245  260  20  11  ...  22   4   2
1     Amore  ECO  1.33  1.15  1.60  237  251  217  20  12  ...  22   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   4   2   2     0   0   0
1      0   1   1   0     0   0   0

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0          shy  Yes  1.07  1.16  1.02  212  273  172  15   7  ...  20   6   2
1     McKonsti  Yes  0.84  0.87  0.82  203  272  158  13   7  ...  23   1   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   3   2   1    +3   0  +3
1      1   1   0   1     0   0   0

[2 rows x 38 columns]

7 >> Team Fragster 0:1 Sissi State Punks

Type         Name  Team     R              ACS             K      ... HS%  FK  \
Side         Name  Team   all   atk   def  all  atk  def all atk  ... def all
0     zProtection  Team  1.15  0.96  1.34  263  246  280  26  12  ...  34   2
1         torture  Team  1.08  1.68  0.49  239  360  120  26  20  ...  14   6

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      0   2   3   2   1    -1  -2  +1
1      6   0   5   3   2    +1  +3  -2

[2 rows x 38 columns]

Type     Name  Team     R              ACS             K      ... HS%  FK      \
Side     Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0        vaLi  Siss  1.23  0.87  1.59  223  121  327  23   6  ...  50   3   0
1     UNCAGED  Siss  1.16  1.45  0.87  218  244  193  23  15  ...  22   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   1   1   0    +2  -1  +3
1      0   1   0   1    -1   0  -1

[2 rows x 38 columns]

Type         Name  Team     R              ACS             K      ... HS%  FK  \
Side         Name  Team   all   atk   def  all  atk  def all atk  ... def all
0     zProtection  Team  1.15  0.96  1.34  263  246  280  26  12  ...  34   2
1         torture  Team  1.08  1.68  0.49  239  360  120  26  20  ...  14   6

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      0   2   3   2   1    -1  -2  +1
1      6   0   5   3   2    +1  +3  -2

[2 rows x 38 columns]

Type     Name  Team     R              ACS             K      ... HS%  FK      \
Side     Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0        vaLi  Siss  1.23  0.87  1.59  223  121  327  23   6  ...  50   3   0
1     UNCAGED  Siss  1.16  1.45  0.87  218  244  193  23  15  ...  22   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   1   1   0    +2  -1  +3
1      0   1   0   1    -1   0  -1

[2 rows x 38 columns]

8 >> Doomster 0:1 Reveal Multigaming

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Rexon  Doom  1.11  1.55  0.67  212  296  129  19  14  ...  29   0   0
1     shiio  Doom  1.05  1.31  0.79  227  276  180  19  11  ...  18   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   1   0    -1  -1   0
1      0   0   0   0     0   0   0

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Magnus   RV  1.46  1.63  1.29  314  369  260  28  17  ...  21   8   5
1      RxYaL   RV  1.29  1.49  1.08  258  282  236  22  13  ...  24   5   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   3   3   0    +5  +2  +3
1      3   1   0   1    +4  +2  +2

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Rexon  Doom  1.11  1.55  0.67  212  296  129  19  14  ...  29   0   0
1     shiio  Doom  1.05  1.31  0.79  227  276  180  19  11  ...  18   0   0

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   1   0    -1  -1   0
1      0   0   0   0     0   0   0

[2 rows x 38 columns]

Type    Name Team     R              ACS             K      ... HS%  FK      \
Side    Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Magnus   RV  1.46  1.63  1.29  314  369  260  28  17  ...  21   8   5
1      RxYaL   RV  1.29  1.49  1.08  258  282  236  22  13  ...  24   5   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   3   3   0    +5  +2  +3
1      3   1   0   1    +4  +2  +2

[2 rows x 38 columns]

9 >> eSports Cologne 1:0 WAS JETZT?

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      zery  ECO  1.46  1.54  1.40  314  307  320  22  10  ...  26   2   0
1     Glenn  ECO  1.38  1.45  1.33  273  260  283  19   7  ...  39   3   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   1   1   0    +1  -1  +2
1      1   1   1   0    +2  +1  +1

[2 rows x 38 columns]

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     reyvn  WAS  1.26  1.43  1.01  298  306  288  22  14  ...  29   1   1
1     kev1n  WAS  0.86  0.94  0.74  186  190  180  12   7  ...  83   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   0   1     0  +1  -1
1      1   1   1   0    +1   0  +1

[2 rows x 38 columns]

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0      zery  ECO  1.46  1.54  1.40  314  307  320  22  10  ...  26   2   0
1     Glenn  ECO  1.38  1.45  1.33  273  260  283  19   7  ...  39   3   2

Type      FD         +/–.1
Side def all atk def   all atk def
0      2   1   1   0    +1  -1  +2
1      1   1   1   0    +2  +1  +1

[2 rows x 38 columns]

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     reyvn  WAS  1.26  1.43  1.01  298  306  288  22  14  ...  29   1   1
1     kev1n  WAS  0.86  0.94  0.74  186  190  180  12   7  ...  83   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   1   0   1     0  +1  -1
1      1   1   1   0    +1   0  +1

[2 rows x 38 columns]

10 >> Capybara Huggers 1:0 Bloodh0nd Gang

Type      Name  Team     R              ACS             K      ... HS%  FK  \
Side      Name  Team   all   atk   def  all  atk  def all atk  ... def all
0       W4nteD  Capy  1.85  2.23  1.63  305  311  302  25  10  ...  23   0
1     Belyaks1  Capy  1.46  1.34  1.53  260  222  283  18   6  ...  17   4

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      0   0   0   0   0     0   0   0
1      2   2   1   0   1    +3  +2  +1

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Ayzee  Bloo  0.90  1.14  0.48  268  289  234  19  13  ...  18   1   1
1      kemo  Bloo  0.68  0.63  0.77  203  194  220  13   7  ...  50   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   3   2   1    -2  -1  -1
1      0   2   0   2    -1  +1  -2

[2 rows x 38 columns]

Type      Name  Team     R              ACS             K      ... HS%  FK  \
Side      Name  Team   all   atk   def  all  atk  def all atk  ... def all
0       W4nteD  Capy  1.85  2.23  1.63  305  311  302  25  10  ...  23   0
1     Belyaks1  Capy  1.46  1.34  1.53  260  222  283  18   6  ...  17   4

Type          FD         +/–.1
Side atk def all atk def   all atk def
0      0   0   0   0   0     0   0   0
1      2   2   1   0   1    +3  +2  +1

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     Ayzee  Bloo  0.90  1.14  0.48  268  289  234  19  13  ...  18   1   1
1      kemo  Bloo  0.68  0.63  0.77  203  194  220  13   7  ...  50   1   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      0   3   2   1    -2  -1  -1
1      0   2   0   2    -1  +1  -2

[2 rows x 38 columns]

11 >> RedPack eSports 0:1 Sissi State Punks

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     17nik   RP  1.22  1.09  1.33  228  207  248  21  10  ...  32   6   2
1     NeXie   RP  1.15  1.58  0.76  265  327  210  20  13  ...  18   4   4

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   1   1   0    +5  +1  +4
1      0   1   0   1    +3  +4  -1

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      KovaQ  Siss  1.45  1.88  0.98  322  405  233  26  18  ...  26   3   2
1     GunnyX  Siss  1.42  0.89  1.99  327  215  450  26   9  ...  16   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      1   2   1   1    +1  +1   0
1      1   5   3   2    -3  -2  -1

[2 rows x 38 columns]

Type   Name Team     R              ACS             K      ... HS%  FK      \
Side   Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0     17nik   RP  1.22  1.09  1.33  228  207  248  21  10  ...  32   6   2
1     NeXie   RP  1.15  1.58  0.76  265  327  210  20  13  ...  18   4   4

Type      FD         +/–.1
Side def all atk def   all atk def
0      4   1   1   0    +5  +1  +4
1      0   1   0   1    +3  +4  -1

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      KovaQ  Siss  1.45  1.88  0.98  322  405  233  26  18  ...  26   3   2
1     GunnyX  Siss  1.42  0.89  1.99  327  215  450  26   9  ...  16   2   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      1   2   1   1    +1  +1   0
1      1   5   3   2    -3  -2  -1

[2 rows x 38 columns]

12 >> Capybara Huggers 0:1 Reveal Multigaming

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     stepa  Capy  1.01  1.09  0.93  228  248  209  24  14  ...  28   3   0
1       Nex  Capy  0.93  0.98  0.87  192  235  151  22  13  ...   8   3   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   6   5   1    -3  -5  +2
1      2   4   3   1    -1  -2  +1

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0       Magnus   RV  1.38  1.50  1.27  296  314  279  35  19  ...  24   8   1
1     YoungOne   RV  1.32  0.72  1.93  281  180  382  32   9  ...  25   6   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      7   6   5   1    +2  -4  +6
1      3   2   1   1    +4  +2  +2

[2 rows x 38 columns]

Type   Name  Team     R              ACS             K      ... HS%  FK      \
Side   Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0     stepa  Capy  1.01  1.09  0.93  228  248  209  24  14  ...  28   3   0
1       Nex  Capy  0.93  0.98  0.87  192  235  151  22  13  ...   8   3   1

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   6   5   1    -3  -5  +2
1      2   4   3   1    -1  -2  +1

[2 rows x 38 columns]

Type      Name Team     R              ACS             K      ... HS%  FK      \
Side      Name Team   all   atk   def  all  atk  def all atk  ... def all atk
0       Magnus   RV  1.38  1.50  1.27  296  314  279  35  19  ...  24   8   1
1     YoungOne   RV  1.32  0.72  1.93  281  180  382  32   9  ...  25   6   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      7   6   5   1    +2  -4  +6
1      3   2   1   1    +4  +2  +2

[2 rows x 38 columns]

13 >> eSports Cologne 0:1 Sissi State Punks

Type  Name Team     R              ACS             K      ... HS%  FK          \
Side  Name Team   all   atk   def  all  atk  def all atk  ... def all atk def
0      ara  ECO  1.14  1.03  1.28  263  242  289  19  10  ...  58   4   2   2
1     zery  ECO  1.11  1.38  0.78  214  252  169  16  11  ...  14   0   0   0

Type  FD         +/–.1
Side all atk def   all atk def
0      3   2   1    +1   0  +1
1      0   0   0     0   0   0

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      KovaQ  Siss  1.40  1.19  1.58  295  256  328  24  10  ...  35   5   2
1     GunnyX  Siss  1.29  1.57  1.06  310  363  267  23  13  ...  15   5   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   4   2   2    +1   0  +1
1      2   1   1   0    +4  +2  +2

[2 rows x 38 columns]

Type  Name Team     R              ACS             K      ... HS%  FK          \
Side  Name Team   all   atk   def  all  atk  def all atk  ... def all atk def
0      ara  ECO  1.14  1.03  1.28  263  242  289  19  10  ...  58   4   2   2
1     zery  ECO  1.11  1.38  0.78  214  252  169  16  11  ...  14   0   0   0

Type  FD         +/–.1
Side all atk def   all atk def
0      3   2   1    +1   0  +1
1      0   0   0     0   0   0

[2 rows x 38 columns]

Type    Name  Team     R              ACS             K      ... HS%  FK      \
Side    Name  Team   all   atk   def  all  atk  def all atk  ... def all atk
0      KovaQ  Siss  1.40  1.19  1.58  295  256  328  24  10  ...  35   5   2
1     GunnyX  Siss  1.29  1.57  1.06  310  363  267  23  13  ...  15   5   3

Type      FD         +/–.1
Side def all atk def   all atk def
0      3   4   2   2    +1   0  +1
1      2   1   1   0    +4  +2  +2

[2 rows x 38 columns]

# Cleaning Data

In [ ]:
def get_default(serie,func,dtype,default=np.nan):
    
    try:
        return serie.map(func).map(dtype)
    except AttributeError as e:
        return pd.Series([default] * serie.shape[0])

In [ ]:
series = pd.Series([1,2,3,4,5])
get_default(series,lambda x : x*2,int)

In [ ]:
def temp_clean_df(df,func):
    result_df = pd.DataFrame()
    
    result_df['Name'] = df['Unnamed: 0'].map(lambda n : n.split(' ')[0])
    result_df['Team'] = df['Unnamed: 0'].map(lambda n : n.split(' ')[1])
    result_df['R'] = get_default(df['R'],func,float)
    result_df['ACS'] = get_default(df['ACS'],func,int)
    result_df['K'] = get_default(df['K'],func,int)
    result_df['D'] = df['D'].map(lambda d : d[1:-1].strip()).map(func).map(int)
    result_df['A'] = df['A'].map(func).map(int)
    result_df['KD_Diff'] = df['+/–'].map(func).map(lambda d : int(d))
    result_df['KAST%'] = df['KAST'].map(func).map(lambda p : int(p[:-1])/100)
    result_df['ADR'] = df['ADR'].map(func).map(int)
    result_df['HS%'] = df['HS%'].map(func).map(lambda p : int(p[:-1])/100)
    result_df['FK'] = df['FK'].map(func).map(int)
    result_df['FD'] = df['FD'].map(func).map(int)
    result_df['FKFD_Diff'] = df['+/–.1'].map(func).map(int)
    
    
    
    return result_df

In [ ]:
def clean_df(df,func):
    result_df = pd.DataFrame()
    
    result_df['Name'] = df['Unnamed: 0'].map(lambda n : n.split(' ')[0])
    result_df['Team'] = df['Unnamed: 0'].map(lambda n : n.split(' ')[1])
    result_df['R'] = df['R'].map(func).map(float)
    result_df['ACS'] = df['ACS'].map(func).map(int)
    result_df['K'] = df['K'].map(func).map(int)
    result_df['D'] = df['D'].map(lambda d : d[1:-1].strip()).map(func).map(int)
    result_df['A'] = df['A'].map(func).map(int)
    result_df['KD_Diff'] = df['+/–'].map(func).map(lambda d : int(d))
    result_df['KAST%'] = df['KAST'].map(func).map(lambda p : int(p[:-1])/100)
    result_df['ADR'] = df['ADR'].map(func).map(int)
    result_df['HS%'] = df['HS%'].map(func).map(lambda p : int(p[:-1])/100)
    result_df['FK'] = df['FK'].map(func).map(int)
    result_df['FD'] = df['FD'].map(func).map(int)
    result_df['FKFD_Diff'] = df['+/–.1'].map(func).map(int)
    
    
    
    return result_df

In [ ]:
def get_clean_df(df):
    result = {}
    def get_all(s):
        try:
            return s.split(' ')[0]
        except AttributeError:
            return '00'
    
    def get_atk(s):
        try:
            return s.split(' ')[2]
        except AttributeError:
            return '00'
    
    def get_def(s):
        try:
            return s.split(' ')[4]
        except AttributeError:
            return '00'

    for side in ['all','atk','def']:
        result[side] = clean_df(df,eval(f'get_{side}'))
        
    return result

# Testing

In [ ]:
sample_match = completed_matches[21]

In [ ]:
match_res = httpx.get(match_url := f'{base_url}{sample_match.attributes["href"]}')

match_html = HTMLParser(match_res.text)

match_name = match_html.css_first('title').text().strip().split(' | ')[0].split(' vs. ')

messy_match_result = match_html.css_first('div.js-spoiler').text()
match_result = ' ' + ''.join(re.findall("\S+",messy_match_result)) + ' '
print(match_sum:=match_result.join(match_name))

tables = match_html.css('table.wf-table-inset')

for table in tables:
    for t in pd.read_html(table.html):
        # display(transform_subcolumns_df(t))
        og_sample_df = t
        # for key,df in get_clean_df(t).items():
        #     pass

In [3]:
def extract_data(data) -> str:
    try:
        list_data = re.findall('[\d+-.]+',data)
        if (ll:=len(list_data)) == 0:
            return 'Nan Nan Nan'
        elif ll < 3:
            list_data += ['0'] * (3-ll)
        return ' '.join(list_data)
    except TypeError:
        return f'{data} Nan Nan'

In [4]:
sample_df.D.map(extract_data)

NameError: name 'sample_df' is not defined

In [5]:
nan_list = re.findall('[\d+-.]+','Nan Nan Nan')
len(nan_list)

0

In [2]:
def transform_subcolumns_df(df):
    filled_df =df.fillna('Nan Nan Nan').astype('object')
    
    name = filled_df.iloc[:,0].map(lambda s : s.split(' ')[0])
    team = filled_df.iloc[:,0].map(lambda s : s.split(' ')[1])
    
    filled_df.iloc[:,0] = name
    filled_df.iloc[:,1] = team
    
    formatted_df = filled_df.rename(columns={'Unnamed: 0':'Name','Unnamed: 1':'Team'})
    
    
    
    # formatted_df.iloc[:,2:] = formatted_df.iloc[:,2:].applymap(lambda x :  ' '.join(re.findall("[\d+-.]+",x,re.A)))
    formatted_df.iloc[:,2:] = formatted_df.iloc[:,2:].applymap(extract_data)
    
    
    
    new_columns = []
    for c in formatted_df.columns[2:]:
        for side in ['all','atk','def']:
            new_columns.append((c,side))

    new_columns = np.array(new_columns).reshape(-1,3,2)
    
    
    result_df = pd.DataFrame(formatted_df.iloc[:,:2])
    
    
    result_df.columns = [('Name','Name'),('Team','Team')]
    
    
    for nc,c in zip(new_columns,formatted_df.iloc[:,2:].columns):
        result_df[list(map(lambda x: tuple(x),list(nc)))] = formatted_df[c].str.split(' ',expand=True)
        
    
    result_df.columns = pd.MultiIndex.from_tuples(result_df.columns,name=['Type','Side'])
    
    return result_df

In [ ]:
sample_df = og_sample_df.copy()

In [ ]:
sample_df

In [ ]:
transform_subcolumns_df(sample_df)

In [ ]:
sample_df[['K','D','A']].info()

In [ ]:
sample_df.D.map(extract_data)

In [ ]:
sample_df = sample_df.fillna('0').astype('object')

In [ ]:
sample_df

In [ ]:
sample_df.info()

In [ ]:
sample_df['R'].map(lambda x : re.findall("[\d+-.]+",x))

In [ ]:
sample_df['R']

## Sub Column Approach

In [ ]:
sample_df

In [ ]:
name = sample_df.iloc[:,0].map(lambda s : s.split(' ')[0])
team = sample_df.iloc[:,0].map(lambda s : s.split(' ')[1])

In [ ]:
sample_df=sample_df.rename(columns={'Unnamed: 0':'Name','Unnamed: 1':'Team'})

In [ ]:
sample_df.iloc[:,0] = name
sample_df.iloc[:,1] = team
display(sample_df)

In [ ]:
def extract_data(data) -> str:
    list_data = re.findall("[\d+-.]+",data)
    
    if len(list_data) < 3:
        result = '0 0 0'
    else:
        result = ' '.join(list_data)
    
    return result

In [ ]:
sample_df['R'].map(extract_data)

In [ ]:
sample_df.iloc[:,2:] = sample_df.iloc[:,2:].applymap(lambda x :  ' '.join(re.findall("[\d+-.]+",x,re.A)))
sample_df

In [ ]:
new_columns = []
for c in sample_df.columns[2:]:
    for side in ['all','atk','def']:
        new_columns.append((c,side))
    
new_columns = np.array(new_columns).reshape(-1,3,2)

In [ ]:
for i in new_columns[::3]:
    print(i)

In [ ]:
sample_df

In [ ]:
new_sample_df = pd.DataFrame(sample_df.iloc[:,:2])

In [ ]:
new_sample_df.columns = [('Name','Name'),('Team','Team')]

In [ ]:
for nc,c in zip(new_columns,sample_df.iloc[:,2:].columns):
    new_sample_df[list(map(lambda x: tuple(x),list(nc)))] = sample_df[c].str.split(' ',expand=True)

In [ ]:
new_sample_df.columns = pd.MultiIndex.from_tuples(new_sample_df.columns,name=['Type','Side'])

In [ ]:
new_sample_df